app/validators/email_validator.rb

  def validate(record)
    email = record.email

    if email.blank?
      record.errors.add(:email, "can't be blank")
    end

    if User.exists?(email: email)
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test13@mail.com"], ["LIMIT", 1]]