app/controllers/api/v1/user/registrations_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest", "name", "birth_date", "gender", "height", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"