app/controllers/api/v1/exercises_controller.rb

  def index
    @exercises = Exercise.all.includes(:muscle_groups).order(:name)
---
SELECT "exercises".* FROM "exercises" ORDER BY "exercises"."name" ASC
SELECT "exercises_muscle_groups".* FROM "exercises_muscle_groups" WHERE "exercises_muscle_groups"."exercise_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)
SELECT "muscle_groups".* FROM "muscle_groups" WHERE "muscle_groups"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 39], ["id", 40], ["id", 41], ["id", 42], ["id", 43], ["id", 44], ["id", 45], ["id", 46], ["id", 47], ["id", 48]]

  def show
    @exercise = Exercise.find_by(id: params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]